List articles = [
  [
    {
      'type': 'MARKDOWN',
      'data': """
# **SQLге киришүү**

SQL - бул маалымат базаларына жетүү жана аларды башкаруу үчүн стандарттуу тил.

### **SQL деген эмне?**

- SQL структураланган суроо тилин билдирет
- SQL маалымат базаларына кирүүгө жана башкарууга мүмкүндүк берет
- SQL 1986 -жылы Американын Улуттук Стандарттар Институтунун (ANSI), 1987 -жылы Эл аралык Стандартташтыруу Уюмунун (ISO) стандарты болуп калды.
### **SQL эмне кыла алат?**

- SQL маалымат базасына каршы суроолорду аткара алат
- SQL маалымат базасынан маалыматтарды ала алат
- SQL маалымат базасына жазууларды киргизе алат
- SQL маалымат базасындагы жазууларды жаңырта алат
- SQL маалымат базасынан жазууларды жок кыла алат
- SQL жаңы маалымат базаларын түзө алат
- SQL маалымат базасында жаңы таблицаларды түзө алат
- SQL маалымат базасында сакталган процедураларды түзө алат
- SQL маалымат базасында көрүнүштөрдү түзө алат
- SQL таблицаларга, процедураларга жана көрүнүштөргө уруксаттарды коё алат
""",
    },
    {'type': 'YOUTUBE', 'data': 'https://www.youtube.com/watch?v=IXycPq7MnwE'},
  ],
  [
    {
      'type': 'MARKDOWN',
      'data': """
# **SQLге киришүү**

SQL - бул маалымат базаларына жетүү жана аларды башкаруу үчүн стандарттуу тил.

### **SQL деген эмне?**

- SQL структураланган суроо тилин билдирет
- SQL маалымат базаларына кирүүгө жана башкарууга мүмкүндүк берет
- SQL 1986 -жылы Американын Улуттук Стандарттар Институтунун (ANSI), 1987 -жылы Эл аралык Стандартташтыруу Уюмунун (ISO) стандарты болуп калды.
### **SQL эмне кыла алат?**

- SQL маалымат базасына каршы суроолорду аткара алат
- SQL маалымат базасынан маалыматтарды ала алат
- SQL маалымат базасына жазууларды киргизе алат
- SQL маалымат базасындагы жазууларды жаңырта алат
- SQL маалымат базасынан жазууларды жок кыла алат
- SQL жаңы маалымат базаларын түзө алат
- SQL маалымат базасында жаңы таблицаларды түзө алат
- SQL маалымат базасында сакталган процедураларды түзө алат
- SQL маалымат базасында көрүнүштөрдү түзө алат
- SQL таблицаларга, процедураларга жана көрүнүштөргө уруксаттарды коё алат
""",
    },
    {'type': 'YOUTUBE', 'data': 'https://www.youtube.com/watch?v=IXycPq7MnwE'},
  ],
  [
    {
      'type': 'MARKDOWN',
      'data': """
# **SQLге киришүү**

SQL - бул маалымат базаларына жетүү жана аларды башкаруу үчүн стандарттуу тил.

### **SQL деген эмне?**

- SQL структураланган суроо тилин билдирет
- SQL маалымат базаларына кирүүгө жана башкарууга мүмкүндүк берет
- SQL 1986 -жылы Американын Улуттук Стандарттар Институтунун (ANSI), 1987 -жылы Эл аралык Стандартташтыруу Уюмунун (ISO) стандарты болуп калды.
### **SQL эмне кыла алат?**

- SQL маалымат базасына каршы суроолорду аткара алат
- SQL маалымат базасынан маалыматтарды ала алат
- SQL маалымат базасына жазууларды киргизе алат
- SQL маалымат базасындагы жазууларды жаңырта алат
- SQL маалымат базасынан жазууларды жок кыла алат
- SQL жаңы маалымат базаларын түзө алат
- SQL маалымат базасында жаңы таблицаларды түзө алат
- SQL маалымат базасында сакталган процедураларды түзө алат
- SQL маалымат базасында көрүнүштөрдү түзө алат
- SQL таблицаларга, процедураларга жана көрүнүштөргө уруксаттарды коё алат
""",
    },
    {'type': 'YOUTUBE', 'data': 'https://www.youtube.com/watch?v=IXycPq7MnwE'},
  ],
  [
    {
      'type': 'MARKDOWN',
      'data': """
# **SQLге киришүү**

SQL - бул маалымат базаларына жетүү жана аларды башкаруу үчүн стандарттуу тил.

### **SQL деген эмне?**

- SQL структураланган суроо тилин билдирет
- SQL маалымат базаларына кирүүгө жана башкарууга мүмкүндүк берет
- SQL 1986 -жылы Американын Улуттук Стандарттар Институтунун (ANSI), 1987 -жылы Эл аралык Стандартташтыруу Уюмунун (ISO) стандарты болуп калды.
### **SQL эмне кыла алат?**

- SQL маалымат базасына каршы суроолорду аткара алат
- SQL маалымат базасынан маалыматтарды ала алат
- SQL маалымат базасына жазууларды киргизе алат
- SQL маалымат базасындагы жазууларды жаңырта алат
- SQL маалымат базасынан жазууларды жок кыла алат
- SQL жаңы маалымат базаларын түзө алат
- SQL маалымат базасында жаңы таблицаларды түзө алат
- SQL маалымат базасында сакталган процедураларды түзө алат
- SQL маалымат базасында көрүнүштөрдү түзө алат
- SQL таблицаларга, процедураларга жана көрүнүштөргө уруксаттарды коё алат
""",
    },
    {'type': 'YOUTUBE', 'data': 'https://www.youtube.com/watch?v=IXycPq7MnwE'},
  ],
];

List article = [
  {
    'type': 'MARKDOWN',
    'data': """
# **SQLге киришүү**

SQL - бул маалымат базаларына жетүү жана аларды башкаруу үчүн стандарттуу тил.

### **SQL деген эмне?**

- SQL структураланган суроо тилин билдирет
- SQL маалымат базаларына кирүүгө жана башкарууга мүмкүндүк берет
- SQL 1986 -жылы Американын Улуттук Стандарттар Институтунун (ANSI), 1987 -жылы Эл аралык Стандартташтыруу Уюмунун (ISO) стандарты болуп калды.
### **SQL эмне кыла алат?**

- SQL маалымат базасына каршы суроолорду аткара алат
- SQL маалымат базасынан маалыматтарды ала алат
- SQL маалымат базасына жазууларды киргизе алат
- SQL маалымат базасындагы жазууларды жаңырта алат
- SQL маалымат базасынан жазууларды жок кыла алат
- SQL жаңы маалымат базаларын түзө алат
- SQL маалымат базасында жаңы таблицаларды түзө алат
- SQL маалымат базасында сакталган процедураларды түзө алат
- SQL маалымат базасында көрүнүштөрдү түзө алат
- SQL таблицаларга, процедураларга жана көрүнүштөргө уруксаттарды коё алат
""",
  },
  {'type': 'YOUTUBE', 'data': 'https://www.youtube.com/watch?v=IXycPq7MnwE'},
];
