List articles = [
  {
    'title': 'Башкы бет',
    'content': [
      {
        'type': 'MARKDOWN',
        'data': """
# **Башкы бет**

SQL - бул маалымат базаларына жетүү жана аларды башкаруу үчүн стандарттуу тил.

Биздин SQL үйрөткүүчү платформабыз SQLди: MySQL, SQL Server, MS Access, Oracle, Sybase, Informix, Postgres жана башка маалымат база тутумдарында кантип колдонууну үйрөтөт.

### **Ар бир бөлүмдө мисалдар**

Ар бир бөлүмдө теманы жакшы түшүнүү үчүн мисалдар берилет. Ал эми жоопторун код түрүндө ошол эле жерден көрө аласыз!
""",
      },
      {
        'type': 'YOUTUBE',
        'data': 'https://www.youtube.com/watch?v=IXycPq7MnwE'
      },
    ]
  },
  {
    'title': 'SQLге киришүү',
    'content': [
      {
        'type': 'MARKDOWN',
        'data': """
# **SQLге киришүү**

SQL - бул маалымат базаларына жетүү жана аларды башкаруу үчүн стандарттуу тил.

### **SQL деген эмне?**

- SQL структураланган суроо тилин билдирет
- SQL маалымат базаларына кирүүгө жана башкарууга мүмкүндүк берет
- SQL 1986-жылы Американын Улуттук Стандарттар Институтунун (ANSI), 1987-жылы Эл аралык Стандартташтыруу Уюмунун (ISO) стандарты болуп калды.

### **SQL эмне кыла алат?**

- SQL маалымат базасына суроолорду жибере алат
- SQL маалымат базасынан маалыматтарды ала алат
- SQL маалымат базасына маалыматтарды киргизе алат
- SQL маалымат базасындагы маалыматтарды жаңырта алат
- SQL маалымат базасынан маалыматтарды өчүрө кыла алат
- SQL жаңы маалымат базаларын түзө алат
- SQL маалымат базасында жаңы таблицаларды түзө алат
- SQL маалымат базасында сакталган процедураларды түзө алат
- SQL маалымат базасында көрүнүштөрдү түзө алат
- SQL таблицаларга, процедураларга жана көрүнүштөргө уруксаттарды коё алат

### **SQL - бул стандарт, бирок ....**

SQL ANSI/ISO стандарты болсо да, SQL тилинин ар кандай версиялары бар.
Бирок, ANSI стандартына ылайык келүү үчүн, алардын баары жок дегенде негизги буйруктарды (SELECT, UPDATE, DELETE, INSERT, WHERE сыяктуу) колдонушат.

Эскертүү: SQL маалымат базасынын программаларынын көпчүлүгүндө SQL стандартынан тышкары жеке менчик кеңейтүүлөрү бар!

### **Веб-сайттарда SQL колдонуу**

Маалыматтар базасынан маалыматтарды көрсөтүүчү веб-сайт түзүү үчүн сизге төмөнкүлөр керек болот:

- RDBMS маалымат базасы программасы (б.а. MS Access, SQL Server, MySQL)
- PHP же ASP сыяктуу сервердик скрипт тилин колдонуу үчүн
- Каалаган маалыматтарды алуу үчүн SQLди колдонуу
- Баракты стилдөө үчүн HTML/CSSти колдонуу

### 
""",
      },
      {
        'type': 'YOUTUBE',
        'data': 'https://www.youtube.com/watch?v=IXycPq7MnwE'
      },
    ]
  }
];
