List articles = [
  {
    'title': 'Башкы бет',
    'content': [
      {
        'type': 'MARKDOWN',
        'data': """
# **Башкы бет**

SQL - бул маалымат базаларына жетүү жана аларды башкаруу үчүн стандарттуу тил.

Биздин SQL үйрөткүүчү платформабыз SQLди: MySQL, SQL Server, MS Access, Oracle, Sybase, Informix, Postgres жана башка маалымат база тутумдарында кантип колдонууну үйрөтөт.

### **Ар бир бөлүмдө мисалдар**

Ар бир бөлүмдө теманы жакшы түшүнүү үчүн мисалдар берилет. Ал эми жоопторун код түрүндө ошол эле жерден көрө аласыз!
""",
      },
      {
        'type': 'YOUTUBE',
        'data': 'https://www.youtube.com/watch?v=IXycPq7MnwE'
      },
    ]
  },
  {
    'title': 'SQLге киришүү',
    'content': [
      {
        'type': 'MARKDOWN',
        'data': """
# **SQLге киришүү**

SQL - бул маалымат базаларына жетүү жана аларды башкаруу үчүн стандарттуу тил.

### **SQL деген эмне?**

- SQL структураланган суроо тилин билдирет
- SQL маалымат базаларына кирүүгө жана башкарууга мүмкүндүк берет
- SQL 1986-жылы Американын Улуттук Стандарттар Институтунун (ANSI), 1987-жылы Эл аралык Стандартташтыруу Уюмунун (ISO) стандарты болуп калды.

### **SQL эмне кыла алат?**

- SQL маалымат базасына суроолорду жибере алат
- SQL маалымат базасынан маалыматтарды ала алат
- SQL маалымат базасына маалыматтарды киргизе алат
- SQL маалымат базасындагы маалыматтарды жаңырта алат
- SQL маалымат базасынан маалыматтарды өчүрө кыла алат
- SQL жаңы маалымат базаларын түзө алат
- SQL маалымат базасында жаңы таблицаларды түзө алат
- SQL маалымат базасында сакталган процедураларды түзө алат
- SQL маалымат базасында көрүнүштөрдү түзө алат
- SQL таблицаларга, процедураларга жана көрүнүштөргө уруксаттарды коё алат

### **SQL - бул стандарт, бирок ....**

SQL ANSI/ISO стандарты болсо да, SQL тилинин ар кандай версиялары бар.
Бирок, ANSI стандартына ылайык келүү үчүн, алардын баары жок дегенде негизги буйруктарды (SELECT, UPDATE, DELETE, INSERT, WHERE сыяктуу) колдонушат.

Эскертүү: SQL маалымат базасынын программаларынын көпчүлүгүндө SQL стандартынан тышкары жеке менчик кеңейтүүлөрү бар!

### **Веб-сайттарда SQL колдонуу**

Маалыматтар базасынан маалыматтарды көрсөтүүчү веб-сайт түзүү үчүн сизге төмөнкүлөр керек болот:

- RDBMS маалымат базасы программасы (б.а. MS Access, SQL Server, MySQL)
- PHP же ASP сыяктуу сервердик скрипт тилин колдонуу үчүн
- Каалаган маалыматтарды алуу үчүн SQLди колдонуу
- Баракты стилдөө үчүн HTML/CSSти колдонуу

### **RDBMS**

RDBMS - Реляциялык Маалымат Базасын Башкаруу Системасы (Relational Database Management System) дегенди билдирет.
RDBMS - SQL, MS SQL Server, IBM DB2, Oracle, MySQL жана Microsoft Access сыяктуу бардык заманбап маалымат системалары үчүн негиз болуп саналат.
RDBMSтеги маалыматтар таблица деп аталган маалымат базасынын объекттеринде сакталат. Таблица - бул тиешелүү маалыматтардын жыйнагы жана ал мамычалардан жана саптардан турат.
"Кардарлар" таблицасын караңыз:
```
SELECT * FROM Customers;
```     
""",
      },
      {
        'type': 'IMAGE',
        'data': 'https://drive.google.com/file/d/1MsxVaFSD0lijumCeJ8aRfdB5GM3NuCGQ/view?usp=sharing'
      },
      {
        'type': 'MARKDOWN',
        'data': """
Ар бир таблица колонка деп аталган кичинекей вертикалдуу объекттерге бөлүнөт. Бул таблица CustomerID, CustomerName, ContactName, Address, City, PostalCode жана Country деген колонкалардан турат. Колонка - бул жадыбалдагы ар бир жазуу жөнүндө конкреттүү маалыматты сактоо үчүн иштелип чыккан вертикалдуу клеткалардын топтому.

Ал эми горизонталдуу клеткалар топтому сап деп аталат. Мисалы, жогорудагы кардарлар таблицасында 10 кардардын маалыматтары бар.
""",  
      },
      {
        'type': 'YOUTUBE',
        'data': 'https://www.youtube.com/watch?v=IXycPq7MnwE'
      },
    ]
  },
  {
    'title': 'SQLдин синтаксиси',
    'content': [
      {
        'type': 'MARKDOWN',
        'data': """
# **Маалыматтар базасынын таблицалары**

Маалыматтар базасы көбүнчө бир же бир нече таблицаларды камтыйт. Ар бир таблица аталышы менен аныкталат (мис. "Кардарлар" же "Заказдар"). Таблицалар маалыматтары бар жазууларды (саптарды) камтыйт.

Бул окуу куралында биз белгилүү Northwind маалыматтар базасын колдонобуз (MS Access жана MS SQL Serverге киргизилген).

Төмөндө "Кардарлар" таблицасы берилген:
""",
      },
      {
        'type': 'IMAGE',
        'data': 'https://drive.google.com/file/d/1GZEPBUzcQwxPaad1g0McF5jZ_cukfB19/view?usp=sharing'
      },
      {
        'type': 'MARKDOWN',
        'data': """
Жогорудагы таблицада беш сап (ар бир кардарга бирден) жана жети колонка (CustomerID, CustomerName, ContactName, Address, City, PostalCode жана Country) камтылган.

### **SQL командалары**

Маалыматтар базасында аткарышыңыз керек болгон аракеттердин көбү SQL командалары менен жасалат.

Бул окуу куралында биз сизге ар кандай SQL командалары жөнүндө үйрөтөбүз.

### **Муну эсиңизде сактаңыз ...**

SQLдин ачкыч сөздөрү чоң, кичине жазылышы - экөө тең туура болуп эсептелет. Бирок биз бул окуу куралында биз бардык SQL ачкыч сөздөрүн чоң тамга менен жазабыз.

### **SQL командаларынан кийин чекит коюлабы?**

Кээ бир маалымат базасы тутумдары ар бир SQL командаларынын аягында үтүрлүү чекитти талап кылат.

Үтүрлүү чекит - серверге бир эле чакырууда бирден ашык SQL билдирүүсүн аткарууга мүмкүндүк берген маалымат базасы тутумундагы ар бир SQL билдирүүсүн бөлүүнүн стандарттык жолу.

Бул окуу материалында, биз ар бир SQL командасынын аягында үтүрлүү чекитти колдонобуз.

### **Кээ бир эң маанилүү SQL командалары**

- SELECT - маалымат базасынан маалыматтарды чыгарат
- UPDATE - маалымат базасындагы маалыматтарды жаңыртат
- DELETE - маалымат базасынан маалыматтарды өчүрөт
- INSERT INTO - маалымат базасына жаңы маалыматтарды киргизет
- CREATE DATABASE - жаңы маалымат базасын түзөт
- ALTER DATABASE - маалымат базасын өзгөртөт
- CREATE TABLE - жаңы таблица түзөт
- ALTER TABLE - таблицаны өзгөртөт
- DROP TABLE - таблицаны өчүрөт
- CREATE INDEX - индексти түзөт (издөө ачкычы)
- DROP INDEX - индексти өчүрөт

""",
      },



      {
        'type': 'YOUTUBE',
        'data': 'https://www.youtube.com/watch?v=IXycPq7MnwE'
      },
    ]
  },
  {
    'title': 'SQLдеги SELECT командасы',
    'content': [
      {
        'type': 'MARKDOWN',
        'data': """
# **Башкы бет**

SQL - бул маалымат базаларына жетүү жана аларды башкаруу үчүн стандарттуу тил.

Биздин SQL үйрөткүүчү платформабыз SQLди: MySQL, SQL Server, MS Access, Oracle, Sybase, Informix, Postgres жана башка маалымат база тутумдарында кантип колдонууну үйрөтөт.

### **Ар бир бөлүмдө мисалдар**

Ар бир бөлүмдө теманы жакшы түшүнүү үчүн мисалдар берилет. Ал эми жоопторун код түрүндө ошол эле жерден көрө аласыз!
""",
      },
      {
        'type': 'YOUTUBE',
        'data': 'https://www.youtube.com/watch?v=IXycPq7MnwE'
      },
    ]
  },
];
